![title](../data/logo.png)
# <center>ACM NITK
## <center> Assignment 1: Pandas

**Author:** Kevin George Joe (@kevingeorgejoe)

Key Resources:

- [Pandas YouTube tutorial playlist](https://www.youtube.com/watch?v=yzIMircGU5I&list=PL5-da3qGB5ICCsgW1MxlZ0Hq8LL5U3u9y)

In [8]:
import pandas as pd
import numpy as np

In [48]:
path = "../data/a1/titanic/"
data = pd.read_csv(path + "train.csv", low_memory=False)
variableDescription = pd.read_csv(path+"variable-description.csv")

## Variable Description

In [49]:
variableDescription

,Variable,Definition,Key
0,survival,Survival,"0 = No, 1 = Yes"
1,pclass,Ticket class,"1 = 1st, 2 = 2nd, 3 = 3rd"
2,sex,Sex,NaN
3,Age,Age in years,NaN
4,sibsp,# of siblings / spouses aboard the Titanic,NaN
5,parch,# of parents / children aboard the Titanic,NaN
6,ticket,Ticket number,NaN
7,fare,Passenger fare,NaN
8,cabin,Cabin number,NaN
9,embarked,Port of Embarkation,"C = Cherbourg, Q = Queenstown, S = Southampton"

## Variable Notes

**pclass:** A proxy for socio-economic status (SES)
- 1st = Upper
- 2nd = Middle
- 3rd = Lower

**age:** Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

**sibsp:** The dataset defines family relations in this way...
- Sibling = brother, sister, stepbrother, stepsister
- Spouse = husband, wife (mistresses and fianc√©s were ignored)

**parch:** The dataset defines family relations in this way...
- Parent = mother, father
- Child = daughter, son, stepdaughter, stepson
- Some children travelled only with a nanny, therefore parch=0 for them.

# assignment begins here

In [5]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Question #1: What is the** `type()` **of the variable** `data` **?**

In [29]:
type(data)

pandas.core.frame.DataFrame

**Question #1: Find the number of rows and columns of the DataFrame** `data`

*Hint:* use the DataFrame attribute `.shape`

*Why learn this?*

This is handy tool in your ML toolkit when you either add or remove rows and/or columns from the DataFrame that you're working on. (And we'll test this later on ;) )

In [28]:
data.shape

(891, 12)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [7]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### .desribe()

*Resources:* 
- https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.describe.html
- http://www.datasciencemadesimple.com/descriptive-summary-statistics-python-pandas/

**Question #1: Use** `desribe()` **to give you an inital look at statistics about "Age" and "Fare"**

In [ ]:
# Your code here

In [9]:
data[["Age", "Fare"]].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

**Question #2: Use** `desribe()` **to give you an inital look at column statistics excluding** `object` **types**

In [ ]:
# Your code here

In [16]:
data.describe(exclude="O")
data.describe(exclude=[np.object])

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## TODO rename value_counts()

**Question #3: Find the number of men and women on the Titanic**

In [ ]:
# Your code here

# Answer:

In [20]:
data["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

**Question #4: Count the number of unique values in column** `'Pclass'`

*Hint:* use `nunique()`

In [ ]:
# Your code here

# Answer:

In [23]:
data["Pclass"].nunique()

3

**Question #5: Find the number of men and women in each pclass.**

*Hint:* use `.groupby()`

In [ ]:
# Your code here

# Answer:

In [26]:
data.groupby(["Sex"])["Pclass"].value_counts()

Sex     Pclass
female  3         144
        1          94
        2          76
male    3         347
        1         122
        2         108
Name: Pclass, dtype: int64

## .loc()

**Question #8: What's the age of the oldest man and woman aboard the Titanic?**

In [123]:
rowSelection = (data["Sex"] == "male")
print("oldest male:", data.loc[rowSelection]["Age"].max())


rowSelection = (data["Sex"] == "female")
print("oldest female:", data.loc[rowSelection]["Age"].max())

oldest male: 80.0
oldest female: 63.0

**Question #8: What's the age of the oldest man and woman aboard the Titanic whose fares are less than 200? Only display their** `"Name"` , `"Age"` **and** `"Fare"`

In [ ]:
# You code here

# Answer:

In [115]:
colSelection = ["Name", "Age", "Fare"]

# oldest woman with fare > 100
rowSelection = (data["Sex"] == "female") & (data["Fare"] > 100)

print("oldest woman with fare > 100:")
display(data.loc[data.loc[rowSelection]["Age"].idxmax(), colSelection].to_frame().T)


# oldest man with fare > 100
rowSelection = (data["Sex"] == "male") & (data["Fare"] > 100)

print("oldest woman with fare > 100:")
display(data.loc[data.loc[rowSelection]["Age"].idxmax(), colSelection].to_frame().T)

oldest woman with fare > 100:

                     Name Age     Fare
195  Lurette, Miss. Elise  58  146.521

oldest woman with fare > 100:

                  Name Age Fare
438  Fortune, Mr. Mark  64  263